telnum=input('请输入您的手机号')
ylist=['134','135', '136', '137', '138', '139', '147', '150', '151', '152', '157', '158', '159', '182', '183', '187', '188', '198']
dlist=['133', '149', '153', '173', '177', '180', '181', '189', '199']
llist=['130', '131', '132', '145', '155', '156', '166', '171', '175', '176', '185', '186', '166']

if telnum.isdigit():
    if len(telnum)==11:
        if telnum[:3] in ylist:
            print('您的号码为移动号码！')
        elif telnum[:3] in dlist:
            print('您的号码为电信号码！')
        elif telnum[:3] in llist:
            print('您的号码为联通号码！')
        else:
            print('您的号码为未知号码！')
    else:
        print('请输入正确的手机号码！')
else:
    print('您的输入有误！')
